In [6]:
import pandas as pd

## Let's see how to import data from CSV, API(JSON),SQL Database...etc and hold the data in a dataframe object

In [7]:
df_movies =pd.read_csv('Data/IMDB movies.csv')

## Display a maximum of 5 columns

In [8]:
df_movies.head()

,imdb_title_id,title,original_title,year,date_published,genre,duration,country,language,director,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
0,tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
1,tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0
2,tt0002101,Cleopatra,Cleopatra,1912,1912-11-13,"Drama, History",100,USA,English,Charles L. Gaskill,...,"Helen Gardner, Pearl Sindelar, Miss Fielding, ...",The fabled queen of Egypt's affair with Roman ...,5.2,420,$ 45000,NaN,NaN,NaN,24.0,3.0
3,tt0002130,L'Inferno,L'Inferno,1911,1911-03-06,"Adventure, Drama, Fantasy",68,Italy,Italian,"Francesco Bertolini, Adolfo Padovan",...,"Salvatore Papa, Arturo Pirovano, Giuseppe de L...",Loosely adapted from Dante's Divine Comedy and...,7.0,2019,NaN,NaN,NaN,NaN,28.0,14.0
4,tt0002199,"From the Manger to the Cross; or, Jesus of Naz...","From the Manger to the Cross; or, Jesus of Naz...",1912,1913,"Biography, Drama",60,USA,English,Sidney Olcott,...,"R. Henderson Bland, Percy Dyer, Gene Gauntier,...","An account of the life of Jesus Christ, based ...",5.7,438,NaN,NaN,NaN,NaN,12.0,5.0

# #Locate the data in the various rows using .loc function

In [9]:
df_movies.loc[4]

imdb_title_id                                                    tt0002199
title                    From the Manger to the Cross; or, Jesus of Naz...
original_title           From the Manger to the Cross; or, Jesus of Naz...
year                                                                  1912
date_published                                                        1913
genre                                                     Biography, Drama
duration                                                                60
country                                                                USA
language                                                           English
director                                                     Sidney Olcott
writer                                                       Gene Gauntier
production_company                                           Kalem Company
actors                   R. Henderson Bland, Percy Dyer, Gene Gauntier,...
description              An account of the life of Jesus Christ, based ...
avg_vote                                                               5.7
votes                                                                  438
budget                                                                 NaN
usa_gross_income                                                       NaN
worlwide_gross_income                                                  NaN
metascore                                                              NaN
reviews_from_users                                                      12
reviews_from_critics                                                     5
Name: 4, dtype: object

# Import new csv creating an index this time around using column imdb_title_id 
##The Imdb_title_id will no longer be a column in our data

In [10]:
df_movies = pd.read_csv("Data/IMDb movies.csv", index_col = 'imdb_title_id')

In [11]:
df_movies.head(2)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0
tt0001892,Den sorte drøm,Den sorte drøm,1911,1911-08-19,Drama,53,"Germany, Denmark",NaN,Urban Gad,"Urban Gad, Gebhard Schätzler-Perasini",...,"Asta Nielsen, Valdemar Psilander, Gunnar Helse...",Two men of high rank are both wooing the beaut...,5.9,171,NaN,NaN,NaN,NaN,4.0,2.0

## Importing Data from a REST API (i.e JSON)
_In python we decode JSON into dictionaries

In [12]:
df_posts = pd.read_json("https://jsonplaceholder.typicode.com/posts")

In [13]:
df_posts ['id'].count() == len(set(df_posts['id']))

True

In [14]:
df_posts.head(1)

,userId,id,title,body
0,1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...

In [15]:
df_posts.set_index('id', inplace=True)

In [16]:
df_posts.head()

,userId,title,body
id,,,
1,1,sunt aut facere repellat provident occaecati e...,quia et suscipit\nsuscipit recusandae consequu...
2,1,qui est esse,est rerum tempore vitae\nsequi sint nihil repr...
3,1,ea molestias quasi exercitationem repellat qui...,et iusto sed quo iure\nvoluptatem occaecati om...
4,1,eum et est occaecati,ullam et saepe reiciendis voluptatem adipisci\...
5,1,nesciunt quas odio,repudiandae veniam quaerat sunt sed\nalias aut...

In [17]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\lois ann\anaconda3\lib\site-packages (2.8.5)

## Exploratory Data Analysis i.e Descriptive Statistics . Data preparation/cleaning Steps are:
*Run df.info() to check column/row frequencies of null/non null values.
*If more than half of the rows in a column has None/NA/Null Values then we could drop the column.
*If the null values are few, then we can replace them with mean/median/mode
*Deal with duplicate values.Remove and keep only one.
## Performing Descriptive Statistics
*Also run describe() method on your df.This will show frequency/mean/min/max/standard deviation/variance of continuous values(numbers only)
*Check the relationship between continous variables i.e. one column and another

## Data visualization (Charts)

In [18]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 81273 entries, tt0000574 to tt9914286
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   title                  81273 non-null  object
 1   original_title         81273 non-null  object
 2   year                   81273 non-null  int64
 3   date_published         81273 non-null  object
 4   genre                  81273 non-null  object
 5   duration               81273 non-null  int64
 6   country                81234 non-null  object
 7   language               80518 non-null  object
 8   director               81200 non-null  object
 9   writer                 79780 non-null  object
 10  production_company     76948 non-null  object
 11  actors                 81207 non-null  object
 12  description            78843 non-null  object
 13  avg_vote               81273 non-null  float64
 14  votes                  81273 non-null  int64
 15  budget                 22804 non-null  object
 16  usa_gross_income       15094 non-null  object
 17  worlwide_gross_income  29892 non-null  object
 18  metascore              12722 non-null  float64
 19  reviews_from_users     74196 non-null  float64
 20  reviews_from_critics   70286 non-null  float64
dtypes: float64(4), int64(3), object(14)
memory usage: 9.0+ MB

# How to replace the null values in Country

##We replace the values with a measure of tendency since they are few . In this case we choose mode(most common country)because the data type is object(string)

_Budget column has 22804 out of 81273 values which are null. How would we deal with this scenario?

We would drop the column which contains too many null values

Reviews_from_users_ We would replace the null values with the mean if The data type is an integer.

In [19]:
df_movies.columns

Index(['title', 'original_title', 'year', 'date_published', 'genre',
       'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

#### 1.Clean up our columns and check for duplicates

In [20]:
df_movies.head(1)

,title,original_title,year,date_published,genre,duration,country,language,director,writer,...,actors,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics
imdb_title_id,,,,,,,,,,,,,,,,,,,,,
tt0000574,The Story of the Kelly Gang,The Story of the Kelly Gang,1906,1906-12-26,"Biography, Crime, Drama",70,Australia,NaN,Charles Tait,Charles Tait,...,"Elizabeth Tait, John Tait, Norman Campbell, Be...",True story of notorious Australian outlaw Ned ...,6.1,537,$ 2250,NaN,NaN,NaN,7.0,7.0

In [21]:
df_movies_one = pd.read_csv('Data/imdb_data_1000.csv',index_col='Rank')

In [22]:
df_movies_one.head(1)

,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Rank,,,,,,,,,,,
1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0

In [23]:
df_movies_one.columns

Index(['Title', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

In [24]:

df_movies_one.rename(columns = {'Runtime (Minutes)': 'Run_Minutes',
                                'Revenue (Millions)': 'Revenue_Millions'}, inplace = True)

In [25]:
df_movies_one.columns = [c.lower()for c in df_movies_one]

In [26]:
df_movies_one.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'run_minutes', 'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

In [27]:
df_movies_one.shape

(1000, 11)

In [28]:
df_movies_one.drop_duplicates(keep='first', inplace = True)

In [29]:
df_movies_one.shape

(1000, 11)

# Create a temporary data frame, create duplicate values using append method

In [30]:
tmp_df =df_movies_one.append(df_movies_one)

In [31]:
tmp_df = tmp_df.append(df_movies_one)

In [32]:
tmp_df.shape

(3000, 11)

In [33]:
tmp_df_one = tmp_df.copy()

In [34]:
tmp_df.drop_duplicates(inplace = True,keep ='last')

In [35]:
tmp_df.shape

(1000, 11)

In [36]:
tmp_df_one.drop_duplicates(inplace = True, keep =False)

In [37]:
tmp_df_one.shape

(0, 11)

In [38]:
df_movies.shape

(81273, 21)

In [39]:
df_movies_one.shape

(1000, 11)

In [40]:
df_comb = df_movies_one.append(df_movies)

In [41]:
df_comb.shape

(82273, 24)

In [42]:
df_comb.columns

Index(['title', 'genre', 'description', 'director', 'actors', 'year',
       'run_minutes', 'rating', 'votes', 'revenue_millions', 'metascore',
       'original_title', 'date_published', 'duration', 'country', 'language',
       'writer', 'production_company', 'avg_vote', 'budget',
       'usa_gross_income', 'worlwide_gross_income', 'reviews_from_users',
       'reviews_from_critics'],
      dtype='object')

In [43]:
df_movies_one.shape

(1000, 11)

In [44]:
df_movies.shape

(81273, 21)

In [45]:
df_nulls = df_movies_one.isnull().sum()

In [46]:
df_nulls

title                 0
genre                 0
description           0
director              0
actors                0
year                  0
run_minutes           0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

In [47]:
df_movies_one1=df_movies_one.dropna()

In [48]:
df_movies_one1.shape

(838, 11)

In [49]:
df_movies_one2 = df_movies_one.copy()

In [50]:
df_movies_one3 = df_movies_one.copy()

## Remove a column with at least 1 null values

In [51]:
df_movies_one2.dropna(axis=1, inplace = True)

In [52]:
df_movies_one2.shape

(1000, 9)

In [53]:
df_movies_one3.dropna(axis=0, inplace = True)

In [54]:
df_movies_one3.shape

(838, 11)

In [55]:
revenue = df_movies_one['revenue_millions']

In [56]:
revenue.head()

Rank
1    333.13
2    126.46
3    138.12
4    270.32
5    325.02
Name: revenue_millions, dtype: float64

In [57]:
type(revenue)

pandas.core.series.Series

In [58]:
d4= revenue.mean()

In [59]:
d4

82.95637614678897

In [60]:
d_null = revenue.isna()

In [61]:
d_null

Rank
1       False
2       False
3       False
4       False
5       False
        ...
996      True
997     False
998     False
999      True
1000    False
Name: revenue_millions, Length: 1000, dtype: bool

In [62]:
revenue.fillna(d4, inplace = True)

In [63]:
revenue.shape

(1000,)

# Find how many values in series  have the value 'd4' as above

In [64]:
df_movies_one.isnull().sum()

title                0
genre                0
description          0
director             0
actors               0
year                 0
run_minutes          0
rating               0
votes                0
revenue_millions     0
metascore           64
dtype: int64

In [65]:
d5 = df_movies_one.copy()

In [66]:
d5['revenue_millions'].fillna(d5['revenue_millions'].mean(),inplace =True)

In [67]:
d5['metascore'].fillna(d5['metascore'].mean(),inplace =True)

In [68]:
d5.to_csv('data/imdb_1000_clean.csv')

In [69]:
d5.isnull().sum()

title               0
genre               0
description         0
director            0
actors              0
year                0
run_minutes         0
rating              0
votes               0
revenue_millions    0
metascore           0
dtype: int64

In [70]:
d5.isnull()

,title,genre,description,director,actors,year,run_minutes,rating,votes,revenue_millions,metascore
Rank,,,,,,,,,,,
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
996,False,False,False,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False,False,False,False
1000,False,False,False,False,False,False,False,False,False,False,False